In [16]:
import pandas as pd
import numpy as np

In [17]:
# Example DataFrame
df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
})
df

   A  B
0  1  4
1  2  5
2  3  6

In [18]:
def my_func(x):
    return sum(x)



# df.apply( my_func, axis=1)
df.apply( lambda x:sum(x), axis=1)

0    5
1    7
2    9
dtype: int64

In [19]:
df.map( lambda x:x**2)

   A   B
0  1  16
1  4  25
2  9  36

In [20]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [23]:
def my_func(v):
    if v%2==0:
        return 'Even'
    else:
        return v


# Task: Replace evens with 'Even'
df.map( lambda v: 'Even' if v%2==0 else v )

      A     B
0     1  Even
1  Even     5
2     3  Even

In [27]:
to_replace = {
    2:'A',
    4:'B'
}
df.replace(to_replace)

   A  B
0  1  B
1  A  5
2  3  6